app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'brindha.ssiet@gmail.com'
AND `status` = 1
 LIMIT 1
---
    public function authenticate()
    {
        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required',
        ];

        if (!$this->validate($rules)) {
            return redirect()
                ->to('/login')
                ->withInput()
                ->with('errors', $this->validator->getErrors());
        }

        $userModel = new UserModel();

        $user = $userModel
            ->where('email', $this->request->getPost('email'))
            ->where('status', 1)
            ->first();